* Flycheck
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
      :ensure t
      :init (global-flycheck-mode 1)
      )
      (setq flycheck-check-syntax-automatically '(mode-enabled save))
    #+END_SRC

    #+RESULTS:
    | mode-enabled | save |
* Auto-complete
  #+BEGIN_SRC emacs-lisp
    (use-package auto-complete
      :ensure t
      :config
      (ac-config-default)
      ;; disable auto complete, trigger by key
      ;; (setq ac-auto-start nil)
      ;; (define-key ac-mode-map (kbd "M-TAB") 'auto-complete)
      ;; remap key
      (setq ac-use-menu-map t)
      (define-key ac-menu-map "\C-n" 'ac-next)
      (define-key ac-menu-map "\C-p" 'ac-previous)
      ;; add more source
      (setq ac-sources '(
                         ac-source-filename
                         ac-source-symbols
                         ac-source-words-in-same-mode-buffers))
      ;; popup window UI setting
      (set-face-foreground 'ac-candidate-face "white")
      (set-face-background 'ac-candidate-face "gray26")
      (set-face-underline 'ac-candidate-face nil)
      (set-face-underline 'ac-completion-face nil)
      (set-face-background 'ac-selection-face "deepskyblue")
      (setq ac-max-width 0.4)
      (fringe-mode '(0 . nil))
      (setq popup-use-optimized-column-computation nil)
      ;; quick help(doc when complete) setting
      (setq ac-use-quick-help nil)
      ;; (setq ac-quick-help-delay 1.0)
      ;; fuzzy complete
      (setq ac-fuzzy-enable t)
      ;; complete after backspace
      (setq ac-trigger-commands
            (cons 'backward-delete-char-untabify ac-trigger-commands))
    )

    ;; use pop-tip package for auto-compelte
    ;; (use-package pop-tip
    ;;   :ensure t
    ;;   :config
    ;;   (setq ac-quick-help-prefer-pos-tip t)
    ;; )

    (use-package jedi
      :ensure t
      :config
      (add-hook 'python-mode-hook 'jedi:setup)
      (setq jedi:complete-on-dot t)
    )

    ;; set the popup window style to eldoc
    (custom-set-variables
     '(jedi:get-in-function-call-delay 10)
     ;; '(jedi:tooltip-method '(pos-tip eldoc))
     '(jedi:tooltip-method nil)
    )
    ;; set jedi package to speed up
    (setq jedi:server-args
          '("--sys-path" "/Users/wangk/anaconda3/bin/python3"
            "--sys-path" "/Users/wangk/anaconda3/lib/python3.7/site-packages/")
    )
  #+END_SRC

  #+RESULTS:
  | --sys-path | /Users/wangk/anaconda3/bin/python3 | --sys-path | /Users/wangk/anaconda3/lib/python3.7/site-packages/ |

* Backup related
    #+BEGIN_SRC emacs-lisp
      ; copied from others
      (setq
       backup-by-copying t    ;自动备份
       delete-old-versions t ; 自动删除旧的备份文件
       kept-new-versions 10   ; 保留最近的10个备份文件
       kept-old-versions 2   ; 保留最早的2个备份文件
       version-control t    ; 多次备份
       ;; 把生成的备份文件放到统一的一个目录,而不在在文件当前目录生成好多 ~ #的文件
       ;; 如果你编辑某个文件时 后悔了想恢复成以前的一个版本 你可以到这个目录下
       ;; 找到备份的版本
       backup-directory-alist `((".*" . "~/.emacs.d/cache/backup_files/")) ;
       auto-save-file-name-transforms `((".*" "~/.emacs.d/cache/backup_files/" t))
       auto-save-list-file-prefix   "~/.emacs.d/cache/backup_files/saves-")

    #+END_SRC

    #+RESULTS:
    : ~/.emacs.d/cache/backup_files/saves-
* PDF tools
  #+BEGIN_SRC emacs-lisp
    (use-package pdf-tools
      :ensure t
      :config
      (pdf-tools-install))
    (use-package org-pdfview
      :ensure t)
    (add-hook 'pdf-view-mode-hook (lambda()
				    (linum-relative-mode -1)))
  #+END_SRC

  #+RESULTS:
  | (lambda nil (linum-relative-mode -1)) | pdf-tools-enable-minor-modes |

* Terminal
  #+BEGIN_SRC emacs-lisp
    (use-package multi-term
      :ensure t
      :config
      (setq multi-term-program "/bin/zsh")
    )

    (add-hook 'term-mode-hook
          (lambda ()
        (setq term-buffer-maximum-size 10000)))

    (add-hook 'term-mode-hook
          (lambda ()
        (setq show-trailing-whitespace nil)))

    (add-hook 'term-mode-hook (lambda()
        (setq yas-dont-activate t)))

    ;; paste into multi-term
    (evil-set-initial-state 'term-mode 'emacs)
    (add-to-list 'term-bind-key-alist '("s-v" . term-paste))
#+END_SRC

  #+RESULTS:
  : ((s-v . term-paste) (C-c C-c . term-interrupt-subjob) (C-c C-e . term-send-esc) (C-p . previous-line) (C-n . next-line) (C-s . isearch-forward) (C-r . isearch-backward) (C-m . term-send-return) (C-y . term-paste) (M-f . term-send-forward-word) (M-b . term-send-backward-word) (M-o . term-send-backspace) (M-p . term-send-up) (M-n . term-send-down) (M-M . term-send-forward-kill-word) (M-N . term-send-backward-kill-word) (<C-backspace> . term-send-backward-kill-word) (M-r . term-send-reverse-search-history) (M-d . term-send-delete-word) (M-, . term-send-raw) (M-. . comint-dynamic-complete))
* Neotree
  #+BEGIN_SRC emacs-lisp
    (use-package neotree
      :ensure t
      :config
      (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
    )
    ; neotree key setting, avoid conflition with evil-mode
    (add-hook 'neotree-mode-hook
	      (lambda ()
		(define-key evil-normal-state-local-map (kbd "TAB") 'neotree-enter)
		(define-key evil-normal-state-local-map (kbd "q") 'neotree-hide)
		(define-key evil-normal-state-local-map (kbd "RET") 'neotree-enter)
		(define-key evil-normal-state-local-map (kbd "l") 'neotree-enter)
		(define-key evil-normal-state-local-map (kbd "h") 'neotree-select-up-node)
		(define-key evil-normal-state-local-map (kbd "j") 'neotree-next-line)
		(define-key evil-normal-state-local-map (kbd "k") 'neotree-previous-line)
		(define-key evil-normal-state-local-map (kbd "g") 'neotree-refresh)
		(define-key evil-normal-state-local-map (kbd "r") 'neotree-rename-node)
		(define-key evil-normal-state-local-map (kbd "d") 'neotree-delete-node)
		(define-key evil-normal-state-local-map (kbd "N") 'neotree-create-node)
		(define-key evil-normal-state-local-map (kbd "A") 'neotree-stretch-toggle)
		(define-key evil-normal-state-local-map (kbd "H") 'neotree-hidden-file-toggle)))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (define-key evil-insert-state-local-map (kbd TAB) (quote neotree-enter)) | (define-key evil-insert-state-local-map (kbd q) (quote neotree-hide)) | (define-key evil-insert-state-local-map (kbd RET) (quote neotree-enter)) | (define-key evil-insert-state-local-map (kbd l) (quote neotree-enter)) | (define-key evil-insert-state-local-map (kbd h) (quote neotree-select-up-node)) | (define-key evil-insert-state-local-map (kbd j) (quote neotree-next-line)) | (define-key evil-insert-state-local-map (kbd k) (quote neotree-previous-line)) | (define-key evil-insert-state-local-map (kbd g) (quote neotree-refresh)) | (define-key evil-insert-state-local-map (kbd r) (quote neotree-rename-node)) | (define-key evil-insert-state-local-map (kbd d) (quote neotree-delete-node)) | (define-key evil-insert-state-local-map (kbd N) (quote neotree-create-node)) | (define-key evil-insert-state-local-map (kbd A) (quote neotree-stretch-toggle)) | (define-key evil-insert-state-local-map (kbd H) (quote neotree-hidden-file-toggle)) |
  | lambda | nil | (define-key evil-normal-state-local-map (kbd TAB) (quote neotree-enter)) | (define-key evil-normal-state-local-map (kbd q) (quote neotree-hide)) | (define-key evil-normal-state-local-map (kbd RET) (quote neotree-enter)) | (define-key evil-normal-state-local-map (kbd l) (quote neotree-enter)) | (define-key evil-normal-state-local-map (kbd h) (quote neotree-select-up-node)) | (define-key evil-normal-state-local-map (kbd j) (quote neotree-next-line)) | (define-key evil-normal-state-local-map (kbd k) (quote neotree-previous-line)) | (define-key evil-normal-state-local-map (kbd g) (quote neotree-refresh)) | (define-key evil-normal-state-local-map (kbd r) (quote neotree-rename-node)) | (define-key evil-normal-state-local-map (kbd d) (quote neotree-delete-node)) | (define-key evil-normal-state-local-map (kbd N) (quote neotree-create-node)) | (define-key evil-normal-state-local-map (kbd A) (quote neotree-stretch-toggle)) | (define-key evil-normal-state-local-map (kbd H) (quote neotree-hidden-file-toggle)) |

